def cyrillic_to_latin(text: str) -> str:

    combos = [
        ("Ў", "O‘"), ("Ғ", "G‘"), ("Ш", "Sh"), ("Ч", "Ch"), ("Нг", "Ng"),
        ("ў", "o‘"), ("ғ", "g‘"), ("ш", "sh"), ("ч", "ch"), ("нг", "ng"),
    ]
    for kiril, latin in combos:
        text = text.replace(kiril, latin)

    table = str.maketrans({
        "а": "a","б": "b","д": "d","е": "e","ф": "f",
        "г": "g","ҳ": "h","и": "i","ж": "j","к": "k",
        "л": "l","м": "m","н": "n","о": "o","п": "p",
        "қ": "q","р": "r","с": "s","т": "t","у": "u",
        "в": "v","х": "x","й": "y","з": "z",
        "А": "A","Б": "B","Д": "D","Е": "E","Ф": "F",
        "Г": "G","Ҳ": "H","И": "I","Ж": "J","К": "K",
        "Л": "L","М": "M","Н": "N","О": "O","П": "P",
        "Қ": "Q","Р": "R","С": "S","Т": "T","У": "U",
        "В": "V","Х": "X","Й": "Y","З": "Z",
    })

    return text.translate(table)

