def latin_to_cyrillic(text: str) -> str:
 

    combos = [
        ("O‘", "Ў"), ("G‘", "Ғ"), ("Sh", "Ш"), ("Ch", "Ч"), ("Ng", "Нг"),
        ("o‘", "ў"), ("g‘", "ғ"), ("sh", "ш"), ("ch", "ч"), ("ng", "нг"),
    ]
    for latin, kiril in combos:
        text = text.replace(latin, kiril)
    table = str.maketrans({
        "a": "а","b": "б","d": "д","e": "е","f": "ф",
        "g": "г","h": "ҳ","i": "и","j": "ж","k": "к",
        "l": "л","m": "м","n": "н","o": "о","p": "п",
        "q": "қ","r": "р","s": "с","t": "т","u": "у",
        "v": "в","x": "х","y": "й","z": "з",
        "A": "А","B": "Б","D": "Д","E": "Е","F": "Ф",
        "G": "Г","H": "Ҳ","I": "И","J": "Ж","K": "К",
        "L": "Л","M": "М","N": "Н","O": "О","P": "П",
        "Q": "Қ","R": "Р","S": "С","T": "Т","U": "У",
        "V": "В","X": "Х","Y": "Й","Z": "З",
    })

    return text.translate(table)

